In [1]:
import pandas as pd 

data = pd.read_csv("titanic.csv")
data.head()

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1

In [2]:
survived_sex = pd.crosstab(index=data["Survived"], columns=data["Sex"])
survived_sex.index =["died", "survived"]
survived_sex

Sex       female  male
died         154   709
survived     308   142

In [3]:
survived_class = pd.crosstab(index=data["Survived"], columns=data["PClass"])

survived_class.columns = ["class1", "class2", "class3"]
survived_class.index = ["died", "survived"]

survived_class

          class1  class2  class3
died         129     160     573
survived     193     119     138

In [5]:
 %load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [7]:
%sql sqlite:////Users/Ökans/Desktop/SQL_SAFI.sqlite

In [8]:
%%sql   
CREATE TABLE EMPLOYEE(firstname varchar(50),lastname varchar(50));  
INSERT INTO EMPLOYEE VALUES('Tom','Mitchell');  
INSERT INTO EMPLOYEE VALUES('Jack','Ryan');

   sqlite://
 * sqlite:////Users/Ökans/Desktop/SQL_SAFI.sqlite
Done.
1 rows affected.
1 rows affected.

[]

In [9]:
%sql SELECT * from EMPLOYEE;

   sqlite://
 * sqlite:////Users/Ökans/Desktop/SQL_SAFI.sqlite
Done.

[('Tom', 'Mitchell'), ('Jack', 'Ryan')]